app/views/deals/_form.html.erb

SELECT "destinations".* FROM "destinations"
---
  <div class="field">
    <%= collection_select( :deal, :destination_id, Destination.all, :id, :place, {}, {:multiple => false } )%>