app/controllers/deals_controller.rb

  def index
    @deals = Deal.all
---
SELECT "deals".* FROM "deals"

  def new
    @deal = Deal.new
    @regions = Region.all
---
SELECT "regions".* FROM "regions"

  def create
    @deal = current_user.deals.new(deal_params)

    respond_to do |format|
      if @deal.save
---
INSERT INTO "deals" ("user_id", "created_at", "updated_at", "pic_file_name", "pic_content_type", "pic_file_size", "pic_updated_at", "destination_id", "pic1_file_name", "pic1_content_type", "pic1_file_size", "pic1_updated_at", "currency", "category", "video_deal") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @deal.update(deal_params)
---
UPDATE "deals" SET "video_deal" = ?, "updated_at" = ? WHERE "deals"."id" = ?

    def set_deal
      @deal = Deal.find(params[:id])
---
SELECT  "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]