app/controllers/destinations_controller.rb

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    #@deals = Deal.all
    @destination = Destination.find(params[:id])

SELECT "categories".* FROM "categories"
SELECT "regions".* FROM "regions"
---
  def new
    @destination = Destination.new
    @categories = Category.all
    @regions = Region.all

INSERT INTO "destinations" ("created_at", "updated_at", "user_id", "cover_file_name", "cover_content_type", "cover_file_size", "cover_updated_at", "filter") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "has_categories" ("destination_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["destination_id", 1], ["category_id", 1], ["created_at", 2018-03-19 23:27:12 UTC], ["updated_at", 2018-03-19 23:27:12 UTC]]
INSERT INTO "has_regions" ("region_id", "created_at", "updated_at", "destination_id") VALUES (?, ?, ?, ?)  [["region_id", 1], ["created_at", 2018-03-19 23:27:12 UTC], ["updated_at", 2018-03-19 23:27:12 UTC], ["destination_id", 1]]
---
  def create
    @destination = current_user.destinations.new(destination_params)
    @destination.categories = params[:categories]
    @destination.regions = params[:regions]



    respond_to do |format|
      if @destination.save

SELECT  "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_destination
      @destination = Destination.find(params[:id])