app/views/destinations/show.html.erb

SELECT "deals".* FROM "deals" WHERE "deals"."destination_id" = ?  [["destination_id", 1]]
---
        <div class="gridd">
        <% @destination.deals.each do |deal| %>